import React, { forwardRef } from "react";

const CityClubContract = forwardRef((props, ref) => {
	return (
		<main className=" text-right w-[99%] mx-auto" dir="rtl">
			{/* <!-- page1 --> */}
			<page size="A4" className="flex flex-col ">
				{/* <!-- header --> */}
				<div className="w-11/12 mx-auto flex justify-between my-4 items-center ">
					<div className="flex  text-rose-500 text-xl">
						<p className="ml-4 ">رقم العقد </p>(<p className="w-32"></p>)
					</div>
					<div className="flex justify-end">
						<img src="./logo.png" className="w-7/12" alt="one finance" />
					</div>
				</div>
				{/* <!-- end header --> */}
				<div className="mb-auto print:mb-auto w-11/12 mx-auto ">
					<div>
						<h2 className="text-center font-bold">عقد تمويل استهلاكي</h2>
						<h3 className="font-bold underline text-center">
							طبقاً لأحكام القانون رقم 18 لسنة 2020 بشأن تنظيم نشاط التمويل
							الاستهلاكي
						</h3>
						<div className="flex items-center mt-2">
							<p className="font-bold">
								انه في يوم <span>.....................</span>
							</p>
							<p className="font-bold">
								الموافق <span>................</span>
							</p>
						</div>
					</div>

					{/* <!-- -------------------------- --> */}
					<div>
						<p className="font-bold">تحرر هذا العقد بين كل من :</p>
						<p>
							1- شركة: <span className="underline">وان فينانس</span>
							لخدمات التمويل الاستهلاكي(ش.م.م)، سجل تجاري رقم (88676) ، والكائن
							مقرها برج 215 كومبوند وان قطامية، الدور العاشر، الطريق الدائرى،
							القاهرة، جمهورية مصر العربية، ترخيص الهيئة العامة للرقابة المالية
							رقم (34) لسنة 2022
						</p>
						<p>
							ويمثلها في هذا العقد السيد/ حازم صـلاح الدين الســيد مدني بصفته:
							الرئيس التنفيذى والعضو المنتدب
						</p>
						<p className="text-left">(الشركة)</p>
						<p>
							2- <span className="font-bold">السيد (ة) :</span>
							<span>
								.....................................................................................................................................
							</span>
						</p>
						<p>
							والثابت الشخصية بموجب ( بطاقة رقم قومي / جواز سفر ) رقم :
							<span> ................................................... </span>
						</p>
						<p>
							المقيم في :
							<span>
								...........................................................
							</span>
						</p>
						<p className="text-left">(العميل)</p>
					</div>
					{/* <!-- ----------------------------- --> */}
					<div>
						<div className="mt-2">
							<p>
								ولما كان الطرف الثاني ( العميل ) يرغب في الاستفادة مما تقدمه
								الشركة من خدمات تمويلية لشراء السلع والخدمات الجائز تمويلها
								وفقاً لأحكام قانون التمويل الاستهلاكي رقم 18 لسنة 2020.
							</p>
							<p>
								وبعد أن أقر الطرفين بكامل أهليتهما القانونيه للتعاقد والتصرف ،
								تم الاتفاق على :
							</p>
						</div>

						<div className="mt-2 space-y-2">
							<p>
								1. تقوم الشركة بتوفير التمويل اللازم والجائز تمويلها وفقاً
								لأحكام قانون التمويل الاستهلاكي والقرارات الصادرة عن الهيئة وذلك
								بناءاً على طلب العميل.
							</p>
							<p>
								2. حيث تقدم العميل للحصول على تمويل لشراء عضوية نادى سيتى كلوب
								وبياناته كالتالى:
							</p>
						</div>
					</div>

					<table className="table-auto border border-collapse mx-auto w-full ">
						<thead>
							<tr>
								<th className="border p-2">
									تفاصيل مبلغ التمويل
									<br />
									(المبلغ المستحق سدادة )
								</th>
								<th className="border p-2 w-40">المبلغ / جنيه</th>
								<th className="border p-2">نوع التمويل</th>
								<th className="w-48"></th>
							</tr>
						</thead>
						<tbody>
							<tr className="border">
								<td className="border px-2 py-4">مبلغ التمويل</td>
								<td className="border "></td>
								<td className="border px-2 py-4">
									مدة العقد بالشهور <br /> او سنين
								</td>
								<td className="border"></td>
							</tr>
							<tr className="border">
								<td className="border px-1 py-4">
									تكاليف و مصروفات التمويل
									<br />
									العائد السنوي/الشهري
								</td>
								<td className="border "></td>
								<td className="border px-2 py-4">
									عدد اقساط <br /> التمويل
								</td>
								<td className="border"></td>
							</tr>
							<tr className="border">
								<td className="border px-2 py-4">المصروفات الادارية</td>
								<td className="border "></td>
								<td className="border px-2 py-4">
									قيمة القسط <br /> الشهري
								</td>
								<td className="border"></td>
							</tr>
							<tr className="border">
								<td className="border px-2 py-4">المصروفات الاخري</td>
								<td className="border "></td>
								<td className="border px-2 py-4">تاريخ القسط الاول</td>
								<td className="border"></td>
							</tr>
							<tr className="border">
								<td className="border px-2 py-4">
									اجمالي المبلغ المستحق سدادة
								</td>
								<td className="border "></td>
								<td className="border px-2 py-4">تاريخ القسط الاخير</td>
								<td className="border"></td>
							</tr>
						</tbody>
					</table>
					<div className="mt-2 space-y-2">
						<p>
							3. مدة هذا العقد هى المدة المحددة بموجب البند رقم(2) من هذا العقد
							لسداد كامل قيمة أقساط التمويل.
						</p>
						<p>
							4. في جميع الأحوال لا يتم إنهاء التعاقد إلا بعد تسوية المديونية
							المترتبة على هذا العقد ، ويلتزم الطرف الأول بتسليم الطرف الثاني
							مخالصة نهائية تفيد سداده لكافة المستحقات المالية المترتبة عليه.{" "}
						</p>
					</div>
					<div className="space-y-2 mt-2">
						<div className="flex ">
							<p className="ml-4">
								<span>5. بيان السلعة/ الخدمة (بيان نافى للجهالة)</span>
								<span>..................................</span>
							</p>
							<div className="flex">
								<p>تمويل عضوية نادى سيتى كلوب رقم:</p>(<p className="w-32"></p>)
							</div>
						</div>
						<p>
							<span>- سعر السلعة/ الخدمة</span>
							<span>..................................</span>
						</p>
						<p>
							<span>- الدفعة المسددة من العميل وقت التعاقد</span>
							<span>..................................</span>
						</p>

						<p>
							<span>- المبلغ المتبقى (محل التمويل)</span>
							<span>..................................</span>
						</p>
					</div>
					<div className="mt-2 space-y-2">
						<p>
							6. يحق للشركه في اي وقت ان تخطر العميل برغبتها في تعديل شروط العقد
							او اي ملحق خاص به بموجب كتاب مسجل موصي عليه بعلم الوصول وفي حاله
							عدم اعتراض العميل خلال <br />
							(15) يوم من تاريخ الاستلام يعد ذلك قبولا لهذه التعديلات.
						</p>
						<p>
							7. في حاله اعتراض العميل علي التعديلات يجب ان يتم الاعتراض
							بالوسائل المتفق عليها بين العميل والشركه وفي هذه الحاله يتم وقف
							ايه طلبات لعمليات تمويل جديده دون ان يؤثر ذلك علي عمليات التمويل
							القائمه وينتهي العقد بانتهاء اخر عمليه تمويل قائمه وبعدها يحق
							للشركه انهاء التعاقد وتصفيه حساب العميل دون ادني مسؤليه علي
							الشركه.
						</p>
					</div>
					<div className=" mt-2 space-y-2">
						<p>
							8. : تسري على مبلغ التمويل موضوع هذا العقد خلال مدة سريان هذا
							العقد عائد متناقص بواقع
							<span>.......... %</span> (<span>............</span> في المائة )
							سنوياً
						</p>
						<p>
							9. : يلتزم العميل بسداد مصاريف ادارية بواقع نسبة{" "}
							<span>.............. %</span> (<span>...........</span> بالمائة )
							من قيمة مبلغ التمويل إلى الشركة.
						</p>
						<p>
							10. : وفى حالة عدم التزام العميل بسداد الاقساط الشهرية حتى اليوم
							الخامس من تاريخ استحقاقها يحق للشركة فرض غرامة تأخير شهرية قدرها 5
							%
						</p>
						<p>
							11. يحق للعميل تعجيل الوفاء بكل او بعض أقساط التمويل من تاريخ
							استحقاق ثاني قسط شريطة إبداء تلك الرغبة كتابة قبل ميعاد السداد
							المستهدف بمدة لا تقل عن ثلاثين يوما على ان يتم سداد رصيد المديونية
							وفقا لجدول السداد المتفق عليه والمرفق بهذا العقد مع احتساب عمولة
							سداد معجل قدرها
							<span>.......... %</span> على الرصيد المتبقي من قيمه التمويل.
						</p>
						<p>
							12. من المتفق عليه بين الطرفين أن الشركة ( الطرف الأول ) لها توريق
							محفظة ديونها لدى الغير أو خصمها وفقا لأحكام القوانين والقرارات
							الصادرة من مجلس إدارة الهيئة ، وذلك دون معارضة من الطرف الثاني
						</p>
						<p>
							13. تلتزم الشركه باحترام السريه لكامل تعاملات العميل ولايسري هذا
							الالتزام بالسريه علي المعلومات التي قد تكون متاحه للغير بصفه عامه
							او بفعل العميل اومطلوب نشرها او الافصاح عنها بمقتضي القانون اوامر
							قضائي او امر حكومي.
						</p>
						<p>
							14. يلتزم العميل بالإفصاح للشركه عن بيانات دخله وايه ضمانات قد
							تكون متطلبه لابرام عقد التمويل
						</p>
						<p>
							15. من المتفق عليه بين الطرفين ان الشركه تتمتع بصلاحيات الافصاح عن
							بيانات التمويل وحجمه ومدته الي الهيئه وشركات الاستعلام الائتماني
							ولايعد ذلك اخلالا باحترام مبدا السريه الخاص بالعميل
						</p>
					</div>
				</div>
			</page>
			{/* <!-- end page1 --> */}

			{/* <!-- page2 --> */}
			<page size="A4" className="flex flex-col">
				{/* <!-- header --> */}
				<div className="w-11/12 mx-auto flex justify-between py-4 items-center ">
					<div className="flex  text-rose-500 text-xl">
						<p className="ml-4 ">رقم العقد </p>(<p className="w-32"></p>)
					</div>
					<div className="flex justify-end">
						<img src="./logo.png" className="w-6/12" alt="one finance" />
					</div>
				</div>
				{/* <!-- end header --> */}
				<div className="mb-auto print:mb-auto w-11/12 mx-auto ">
					<div className="space-y-2 mt-4">
						<p>
							16. العناوين الواردة قرين مسمى كل طرف في صدر هذا العقد موطناً يصح
							قانوناً مخاطبته عليه ومن ثم كافة الاعلانات القضائية والمراسلات
							والإنذارات والإخطارات التي تتم عليها وفقاً لهذا العقد صحيحة ومنتجة
							لآثارها القانونية ويلتزم كلا من طرفي العقد في حالة حدوث أي تغيير
							عليها بأخطار الطرف الآخر كتابة .
						</p>
						<p>
							17. ومن المعلوم أن أرقام التليفون والفاكس وعناوين البريد
							الإلكتروني والوارد النص عليها في نموذج بيانات العميل المرفق بهذا
							العقد موثقة لدى الشركة ومن ثم يحق للشركة أن ترسل عليها كافة
							الرسائل الترويجية وإشعارات التنفيذ والإخطارات التي تتم وفقاً لهذا
							العقد ، ويلتزم العميل في حالة حدوث أي تغيير عليها بأخطار الشركة
							كتابة .
						</p>
						<p>
							18. تسري على هذا العقد أحكام القوانين المعمول بها في جمهورية مصر
							العربية والقرارات المنفذة لهذه القوانين لا سيما قانون رقم ( ۱۸ )
							لسنة ٢٠٢٠ بإصدار قانون تنظيم نشاط التمويل الاستهلاكي ، وكذلك
							القرارات ، والكتب الدورية ، والتعليمات الصادرة عن الهيئة العامة
							للرقابة المالية .
						</p>
						<div className="space-y-2">
							<p>
								19. تختص المحاكم الاقتصادية بمختلف درجا تها بالفصل في المنازعات
								الناشئة عن تنفيذ أو تفسير هذا العقد وملحقاته.
							</p>
							<p className="text-center">او</p>
							<p>
								الاتفاق علي تسويه النزاع بطريق التحكيم على ان يكون في هذه الحاله
								اختصاص حصريا وينص عليه صراحه بين الاطراف ذلك وفقا للقوانين
								المعمول بها في جمهوريه مصر العربية.
							</p>
						</div>
						<p>
							20. تكون كافة المبالغ المستحقة للشركة بذمة العميل بسبب هذه العقد
							مستحقة الأداء فوراً وتسقط كافة الآجال - وفقاً لمطلق تقدير الشركة –
							دون حاجة إلى إنذار أو تنبيه أو الحصول على حكم قضائي , وذلك في جميع
							الأحوال التي يرتب فيها القانون حلول أجل الدين قبل ميعاده , أو في
							حالة حدوث أي من
						</p>
						<h2> الحالات الأتية :</h2>
						<ul className="space-y-2">
							<li>- إخلال العميل بأي من الالتزامات المتفق عليها بالعقد.</li>
							<li>
								- ثبوت عدم صحة أي من المعلومات أو البيانات أو المستندات المقدمه
								من العميل.
							</li>
							<li>
								- فى حالة تأخر العميل عن سداد ثلاثة من الاقساط الشهرية او رسوم
								ناتجة عن عمليات شراء.
							</li>
						</ul>
						<h2 className="font-bold underline"> 21. شروط وأحكام عامة</h2>
						<ul className="space-y-2">
							<li>
								- يحق للشركة أن تعهد الي اي شخص طبيعي أومعنوي أو من تراه من
								الشركات / أو المكاتب المتخصصة بكل أو بعض أعمال التحصيل وما
								تقتضيه من اتخاذ كافة الإجراءات القانونية وغيرها، ولا يحق للعميل
								التمسك في كل الاحوال بأحكام السرية في هذا الشأن.
							</li>
							<li>
								- يلتزم العميل بالتوقيع على نموذج أعرف عميلك و أن يوافي الشركة
								في أي وقت بأية تغييرات تحدث على بياناته المبينة بصدر هذا العقد.
							</li>
							<li>
								- يلتزم العميل بسداد الاقساط عن طريق قنوات الدفع المتاحة من قبل
								الشركة أو عن طريق شركات تحصيل الأموال أو عن طريق أحد مندوبي
								الشركة وذلك مقابل قيمة إضافية تضاف على قيمة القسط.
							</li>
							<li>
								- الضمانات الواردة في هذا العقد مقرره لصالح الشركة وحدها فيحق
								لها ووفق إرادتها المنفردة التنازل عن أية منها، دون أن يحق للعميل
								الاعتراض على ما تقرره الشركة بشأنها.
							</li>
							<li>
								- تلتزم شركة وان فينانس لخدمات التمويل الاستهلاكى (ش.م.م) بتسليم
								الضمانات المستحقة الاداء والمقسمة على مدار مدة العقد للطرف
								الثاني فور سداد القسط أو قيام الشركة باصدار مخالصة بديلاً عن
								الضمانة.
							</li>
							<li>
								- لا يشكل امتناع الشركة عن ممارسة أي من حقوقها الناتجة عن إسقاط
								الأجل أو غيرها من الحقوق الناتجة عن هذا العقد أو الممنوحة لها
								بموجب نصوص القانون تنازلاً جانبها عن هذه الحقوق.
							</li>
							<li>
								- تقوم شركة وان فينانس لخدمات التمويل الاستهلاكى (ش.م.م) بتسجيل
								الاقساط الشهرية لعملائها لدى الشركة المصرية للاستعلام الائتمانى
								فى حالة توقف العميل عن سداد اى اقساط او رسوم ناتجه عن عمليات
								الشراء بطريق التمويل ويكون للشركة الحق فى ادراج اسم العميل فى
								الشركة المصرية للاستعلام الائتمانى ضمن العملاء المتعثرين .
							</li>
							<li>
								- شركة وان فينانس لخدمات التمويل الاستهلاكى (ش.م.م) غير مسئولة
								عن اى رسوم يتم تحصيلها من اى طرف كان غير المعلن من قبلها.
							</li>
							<li>
								- يحق للشركة ان تقوم بتسجيل المكالمات التليفونية التى تم
								استقبالها على الرقم المخصص لخدمة العملاء وان تحتفظ بها وتكون حجه
								قاطعة فى مواجهة العميل .
							</li>
						</ul>
						<p className="mt-2">
							22. حرر هذا العقد من نسختين بيد، كل طرف نسخة للعمل بموجبها.
						</p>
					</div>
				</div>
				{/* <!-- footer --> */}
				<div className=" border-t mt-4 pt-8 pb-4 w-11/12 mx-auto print:mt-auto">
					<div className="grid grid-cols-2 gap-2 mb-8">
						<div className="flex flex-col items-center justify-center">
							<p className="mb-4">عن الشركة</p>
							<div className="w-40 h-40 rounded-full border"></div>
						</div>
						<div className="flex flex-col items-center justify-center">
							<p className="mb-4">توقيع العميل</p>
							<div className="w-40 h-40 flex items-center justify-center">
								<p>......................................</p>
							</div>
						</div>
					</div>
					{/* <!-- end sign --> */}
					<div className="grid grid-cols-2 gap-2 text-sm">
						<div className="flex flex-col">
							<p>
								رقم السجل التجارى:
								<span>88676</span>
							</p>
							<p>
								رقم الترخيص:
								<span> 34/2022 الصادر عن الهيئة العامة للرقابة المالية </span>
							</p>
						</div>
						{/* <!-- col-2 --> */}
						<div className="flex flex-col">
							<p>
								رقم البطاقة الضريبية:
								<span>679905642</span>
							</p>
							<p>
								عنوان المركز الرئيسى:
								<span>
									{" "}
									برج 215 كومبوند وان قطامية الطريق الدائرى - القاهرة{" "}
								</span>
							</p>
						</div>
					</div>
				</div>
				{/* <!-- end footer --> */}
			</page>
			{/* <!-- end page2 --> */}
		</main>
	);
});
CityClubContract.displayName = "CityClubContract";

export default CityClubContract;
